// NeL - MMORPG Framework <http://dev.ryzom.com/projects/nel/>
// Copyright (C) 2010  Winch Gate Property Limited
//
// This source file has been modified by the following contributors:
// Copyright (C) 2013  Laszlo KIS-ADAM (dfighter) <dfighter1985@gmail.com>
// Copyright (C) 2014-2015  Jan BOON (Kaetemi) <jan.boon@kaetemi.be>
//
// This program is free software: you can redistribute it and/or modify
// it under the terms of the GNU Affero General Public License as
// published by the Free Software Foundation, either version 3 of the
// License, or (at your option) any later version.
//
// This program is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU Affero General Public License for more details.
//
// You should have received a copy of the GNU Affero General Public License
// along with this program.  If not, see <http://www.gnu.org/licenses/>.

#ifndef NL_DRIVER_OPENGL3_H
#define NL_DRIVER_OPENGL3_H

#include "nel/misc/types_nl.h"

//#define NL_PROFILE_DRIVER_OGL
#ifdef NL_PROFILE_DRIVER_OGL
#	define H_AUTO_OGL(label) H_AUTO(label)
#else
#	define H_AUTO_OGL(label)
#endif

#ifdef NL_OS_MAC
#	import  <Cocoa/Cocoa.h>
#	import  "mac/cocoa_opengl3_view.h"
#elif defined (NL_OS_UNIX)
#	ifdef XF86VIDMODE
#		include <X11/extensions/xf86vmode.h>
#	endif //XF86VIDMODE
#endif // NL_OS_UNIX

#include <unordered_set>

#include "nel/misc/matrix.h"
#include "nel/misc/smart_ptr.h"
#include "nel/misc/rgba.h"
#include "nel/misc/event_emitter.h"
#include "nel/misc/bit_set.h"
#include "nel/misc/hierarchical_timer.h"
#include "nel/misc/bitmap.h"
#include "nel/misc/common.h"
#include "nel/misc/heap_memory.h"
#include "nel/misc/event_emitter_multi.h"
#include "nel/misc/time_nl.h"

#include "nel/3d/driver.h"
#include "nel/3d/material.h"
#include "nel/3d/vertex_buffer.h"
#include "nel/3d/ptr_set.h"
#include "nel/3d/texture_cube.h"
#include "nel/3d/vertex_program_parse.h"
#include "nel/3d/viewport.h"
#include "nel/3d/scissor.h"
#include "nel/3d/light.h"
#include "nel/3d/occlusion_query.h"

#include "driver_opengl3_states.h"
#include "driver_opengl3_extension.h"
#include "driver_opengl3_program.h"


#ifdef NL_OS_WINDOWS
#include "nel/misc/win_event_emitter.h"
#elif defined(NL_OS_MAC)
#include "mac/cocoa_event_emitter.h"
#elif defined (NL_OS_UNIX)
#include "unix_event_emitter.h"
#endif // NL_OS_UNIX

// For optimisation consideration, allow 256 lightmaps at max.
#define	NL3D_DRV_MAX_LIGHTMAP		256
#define UNSUPPORTED_INDEX_OFFSET_MSG "Unsupported by driver, check IDriver::supportIndexOffset."

using NLMISC::CMatrix;
using NLMISC::CVector;

#define NL3D_GL3_BUFFER_NOT_IN_FLIGHT (std::numeric_limits<uint64>::max())
#define NL3D_GL3_FRAME_QUEUE_MAX (2) // Maximum is three frames processing (2 frames backlog + current frame)
#define NL3D_GL3_BUFFER_QUEUE_MAX (NL3D_GL3_FRAME_QUEUE_MAX + 1) // Additional buffer for current working
#define NL3D_GL3_SYNC_IMMEDIATE 0 // Don't allow frame processing backlog if set to 1. Reduce input lag. Testing only

namespace NL3D {
namespace NLDRIVERGL3 {

class	CDriverGL3;
class	IVertexBufferGL3;
class	CVertexBufferGL3;
class   COcclusionQueryGL3;

void displayGLError(GLenum error);

#ifdef NL_OS_WINDOWS

bool GlWndProc(CDriverGL3 *driver, HWND hWnd, UINT message, WPARAM wParam, LPARAM lParam);
typedef HCURSOR nlCursor;
#define EmptyCursor (nlCursor)NULL

#elif defined (NL_OS_MAC)

bool GlWndProc(CDriverGL3 *driver, const void* e);
typedef void* nlCursor;
#define EmptyCursor (nlCursor)NULL

#elif defined (NL_OS_UNIX)

bool GlWndProc(CDriverGL3 *driver, XEvent &e);
typedef Cursor nlCursor;
#define EmptyCursor None

#endif

typedef std::list<COcclusionQueryGL3 *> TOcclusionQueryList;

// ***************************************************************************
class COcclusionQueryGL3 : public IOcclusionQuery
{
public:
	GLuint							ID;				// id of gl object
	NLMISC::CRefPtr<CDriverGL3>		Driver;			// owner driver
	TOcclusionQueryList::iterator   Iterator;		// iterator in owner driver list of queries
	TOcclusionType					OcclusionType;  // current type of occlusion
	uint							VisibleCount;	// number of samples that passed the test
	// From IOcclusionQuery
	virtual void begin();
	virtual void end();
	virtual TOcclusionType getOcclusionType();
	virtual uint getVisibleCount();
};

// ***************************************************************************

class CDepthStencilFBO : public NLMISC::CRefCount
{
public:
	CDepthStencilFBO(CDriverGL3 *driver, uint width, uint height);
	~CDepthStencilFBO();

	uint					Width;
	uint					Height;

	GLuint					DepthFBOId;
	GLuint					StencilFBOId;

private:
	CDriverGL3				*m_Driver;
};

// ***************************************************************************
class CTextureDrvInfosGL3 : public ITextureDrvInfos
{
public:
	/*
		ANY DATA ADDED HERE MUST BE SWAPPED IN swapTextureHandle() !!
	*/

	// The GL Id.
	GLuint					ID;
	// Is the internal format of the texture is a compressed one?
	bool					Compressed;
	// Is the internal format of the texture has mipmaps?
	bool					MipMap;

	// This is the computed size of what memory this texture take.
	uint32					TextureMemory;
	// This is the owner driver.
	CDriverGL3				*_Driver;

	// enum to use for this texture (GL_TEXTURE_2D, GL_TEXTURE_RECTANGLE..)
	GLenum					TextureMode;

	// FBO Id
	GLuint					FBOId;

	// depth stencil FBO id
	bool					AttachDepthStencil;
	NLMISC::CSmartPtr<CDepthStencilFBO>	DepthStencilFBO;

	bool					InitFBO;

	// The current wrap modes assigned to the texture.
	ITexture::TWrapMode		WrapS;
	ITexture::TWrapMode		WrapT;
	ITexture::TMagFilter	MagFilter;
	ITexture::TMinFilter	MinFilter;

	// The gl id is auto created here.
	CTextureDrvInfosGL3(IDriver *drv, ItTexDrvInfoPtrMap it, CDriverGL3 *drvGl, bool isRectangleTexture);
	// The gl id is auto deleted here.
	~CTextureDrvInfosGL3();
	// For Debug info. return the memory cost of this texture
	virtual uint	getTextureMemoryUsed() const {return TextureMemory;}

	bool					initFrameBufferObject(ITexture * tex);
	bool					activeFrameBufferObject(ITexture * tex);
};


// ***************************************************************************
class CVBDrvInfosGL3 : public IVBDrvInfos
{
public:
	CVBDrvInfosGL3(CDriverGL3 *drv, ItVBDrvInfoPtrList it, CVertexBuffer *vb);

	// Verex buffer hard ?
	IVertexBufferGL3		*_VBHard;
	CDriverGL3			*_DriverGL;

	// From IVBDrvInfos
	virtual ~CVBDrvInfosGL3();
	virtual uint8	*lock (uint first, uint last, bool readOnly);
	virtual void	unlock (uint first, uint last);
};

// ***************************************************************************
// Camera UBO data layout (std140, 240 bytes, matches GLSL NlCamera block)
struct CCameraUBOData
{
	float viewMatrix[16];    // 64
	float fogColor[4];       // 16
	float pzbCameraPos[3];   // 12
	float fogDensity;        //  4
	float fogParams[2];      //  8
	sint32 fogMode;          //  4
	sint32 clipPlaneMask;    //  4
	float clipPlane[6][4];   // 96
	float cameraWorldPos[3]; // 12  (inverse view translation: actual camera world position)
	float _pad0;             //  4
};                           // 224
static_assert(sizeof(CCameraUBOData) == 224, "Camera UBO layout mismatch");

// ***************************************************************************
// CPU-side struct matching the std140 NlLightInfo layout (96 bytes)
struct CLightTableUBOEntry
{
	float dirOrPos[3];     // 0
	sint32 mode;           // 12
	float diffuse[4];      // 16
	float specular[4];     // 32
	float constAttn;       // 48
	float linAttn;         // 52
	float quadAttn;        // 56
	float spotExp;         // 60
	float spotDir[3];      // 64
	float spotCutoff;      // 76
	float ambient[4];      // 80
};                         // 96 bytes
static_assert(sizeof(CLightTableUBOEntry) == 96, "CLightTableUBOEntry must match std140 NlLightInfo layout");

// ***************************************************************************
// Per-Object UBO data layout (std140, 304 bytes, matches GLSL NlModel block)
struct CObjectUBOData
{
	float modelViewProjection[16]; // 64
	float modelView[16];           // 64
	float normalMatrix[12];        // 48 (3 cols × {x,y,z,pad} for std140 mat3)
	sint32 lightIndices01[4];      // 16
	sint32 lightIndices45[4];      // 16
	float lightFactors01[4];       // 16
	float lightFactors45[4];       // 16
	float selfIllumination[4];     // 16
	sint32 texGenMode[4];          // 16
	sint32 lighting;               // 4
	sint32 vertexColorLighted;     // 4
	sint32 vertexFormat;           // 4
	sint32 worldSpaceNormal;       // 4
	sint32 worldSpacePosition;     // 4
	sint32 numPerPixelLights;      // 4
	sint32 fogEnabled;             // 4
	sint32 _pad[1];                // 4 (pad to 16-byte std140 alignment)
};                                 // 304
static_assert(sizeof(CObjectUBOData) == 304, "Object UBO layout mismatch");

// ***************************************************************************
// Per-Material UBO data layout (std140, 96 bytes, matches GLSL NlMaterial block)
struct CMaterialUBOData
{
	float materialColor[4];        // 16 (from materialSetup)
	float materialDiffuse[4];      // 16 (from materialSetup)
	float materialSpecular[4];     // 16 (from materialSetup)
	float materialShininess;       // 4 (from materialSetup)
	float alphaRef;                // 4 (from materialSetup)
	sint32 nlShader;               // 4 (from materialSetup)
	sint32 nlTextureActive;        // 4 (from materialSetup)
	sint32 nlAlphaTest;            // 4 (from materialSetup)
	float nlLightMapScale;         // 4 (default 1.0f, only used in lightmap material UBO)
	sint32 _pad[2];               // 8
	// TexEnv block (from setupNormalPass / setupLightmapPass)
	uint32 nlTexEnvMode[4];        // 16 (4 separate uint in GLSL, not an array — avoids std140 vec4 padding)
	// constant[0-3]: TexEnv constant colors (Normal/UserColor shaders)
	// constant[4-7]: EMBM matrices (Normal/UserColor) OR lightmap factors (LightMap shader)
	//               — mutually exclusive by shader type, so they share the same slots
	float constant[IDRV_PROGRAM_MAXSAMPLERS][4]; // 128
	float texMatrix[4][16];        // 256 (texture matrices, VP — mat4 stored column-major)
};                                 // 480
static_assert(sizeof(CMaterialUBOData) == 480, "Material UBO layout mismatch");

// ***************************************************************************
namespace /* anonymous */ {

uint maxTextures(CMaterial::TShader shader)
{
	switch (shader)
	{
	case CMaterial::Specular:
	case CMaterial::UserColor: // UserColor has the same texture set up twice
		return 2;
	default:
		return IDRV_MAT_MAXTEXTURES;
	}
}

uint maxSamplers(CMaterial::TShader shader, CGlExtensions &glext)
{
	switch (shader)
	{
	case CMaterial::LightMap:
		return std::min((GLint)IDRV_PROGRAM_MAXSAMPLERS, glext.MaxFragmentTextureImageUnits);
	default:
		return maxTextures(shader);
	}
}

bool useTexEnv(CMaterial::TShader shader)
{
	return shader == CMaterial::Normal
		|| shader == CMaterial::UserColor;
}

